Autodesk.Navisworks.Api.Point3D
Represents a position in 3D space. Immutable.

Autodesk.Navisworks.Api.Point3D.#ctor
Create a zero vector
Throws System.InvalidOperationException:
Exception when 'false'

Autodesk.Navisworks.Api.Point3D.#ctor(Autodesk.Navisworks.Api.VariantData)
Create a point from a data object of type Point3D
Throws System.ArgumentNullException:
Argument 'data' is null
Throws System.ArgumentException:
Argument 'data' has been Disposed

Autodesk.Navisworks.Api.Point3D.#ctor(System.Double,System.Double,System.Double)
Create a point from X, Y and Z components

Autodesk.Navisworks.Api.Point3D.Add(Autodesk.Navisworks.Api.Vector3D)
Translates a point by a vector to produce a new point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Point3D.Distance
Distance of point from origin
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point3D.DistanceSquared
Distance of point from origin squared
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point3D.DistanceTo(Autodesk.Navisworks.Api.Point3D)
Distance from this point to another point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.Point3D.DistanceToSquared(Autodesk.Navisworks.Api.Point3D)
Distance squared from this point to another point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.Point3D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Point3D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Point3D.IsOrigin
Is this point at the origin (all components zero) ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point3D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Point3D.Item(System.Int32)


Autodesk.Navisworks.Api.Point3D.op_Addition(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Vector3D)
Translates a point by a vector to produce a new point

Autodesk.Navisworks.Api.Point3D.op_Addition(Autodesk.Navisworks.Api.Vector3D,Autodesk.Navisworks.Api.Point3D)
Translates a vector by a point to produce a new point

Autodesk.Navisworks.Api.Point3D.op_Subtraction(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D)
Creates a new Vector from value2 to value1

Autodesk.Navisworks.Api.Point3D.op_Subtraction(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Vector3D)
Translates a point by a vector to produce a new point

Autodesk.Navisworks.Api.Point3D.Origin
Return point at the origin (all components zero)

Autodesk.Navisworks.Api.Point3D.Subtract(Autodesk.Navisworks.Api.Point3D)
Creates a new vector from point to this
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point3D.Subtract(Autodesk.Navisworks.Api.Vector3D)
Translates a point by a vector to produce a new point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Point3D.ToData
Converts point to a data object of type Point3D
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point3D.TolerantEquals(Autodesk.Navisworks.Api.Point3D)
Compare points using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point3D.TolerantEquals(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D)
Compare points using a tolerance
Throws System.ArgumentNullException:
Argument 'point0' is null
Throws System.ArgumentException:
Argument 'point0' has been Disposed
Throws System.ArgumentNullException:
Argument 'point1' is null
Throws System.ArgumentException:
Argument 'point1' has been Disposed

Autodesk.Navisworks.Api.Point3D.TolerantEquals(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D,System.Double)
Compare points using a tolerance
Throws System.ArgumentNullException:
Argument 'point0' is null
Throws System.ArgumentException:
Argument 'point0' has been Disposed
Throws System.ArgumentNullException:
Argument 'point1' is null
Throws System.ArgumentException:
Argument 'point1' has been Disposed

Autodesk.Navisworks.Api.Point3D.TolerantEquals(Autodesk.Navisworks.Api.Point3D,System.Double)
Compare points using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point3D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Point3D.ToVector3D
Convert point to a vector (equivalent to vector from origin to point)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point3D.X
Returns the X component of the point
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point3D.Y
Returns the Y component of the point
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point3D.Z
Returns the Z component of the point
Throws System.ObjectDisposedException:
Object has been Disposed